l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_spi_cb.c
/*
 *  Copyright (C) 2015-2016
 *               Uwe Bonnes(bon@elektron.ikp.physik.tu-darmstadt.de).
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holders nor the names of
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
 * THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * For additional information see http://www.ethernut.de/
 *
 */

/*
 * \file arch/cm3/stm/stm32_spi_cb.c
 * \brief STM32 SPI handler configured by interface control block..
 *
 * The SPI IP has no interrupt for SPI getting idle, so it takes some effort
 * to find the right moment to switch SPI and CS off. To do so, we always
 * count the received byte even if we transmit only.
 * DMA_Mode handles this case per se, but needs TX _and_ RX DMA channels.
 *
 * ToDo:
 * - Use Polling transfer when transfer needs only few cycles.
 * - Allow to specify only either DMA/TX or DMA/RX in addition to both
 *   channels.
 * - Use only one interrupt in interrupt mode, not both TX and RX IRQs.
 * - Use 16-bit transfer when possible.
 */

#include <stdlib.h>
#include <errno.h>

#include <sys/nutdebug.h>
#include <sys/timer.h>
#include <dev/gpio.h>
#include <dev/spibus.h>

#include <arch/cm3/stm/stm32_spi_pinmux.h>
#include <arch/cm3/stm/stm32xxxx.h>
#include <arch/cm3/stm/stm32_gpio.h>
#include <arch/cm3/stm/stm32_dma.h>
#include <arch/cm3/stm/stm32_clk.h>
#include <arch/cm3/stm/stm32_spi_cb.h>

#include <cfg/devices.h>
#include <cfg/spi.h>

static int Stm32SpiCbClkEnable(const STM32_SPI_ICB *bus_icb, int state)
{
    int res;
    uint32_t reg;

    reg = *bus_icb->enable_reg;
    res = (reg & bus_icb->enable_mask);
    if (state) {
        reg |= bus_icb->enable_mask;
    } else {
        reg &= ~bus_icb->enable_mask;
    }
    *bus_icb->enable_reg = reg;
    return res;
}
/*!
 * \brief Stop SPI when in RX-Only mode
 *
 * Follow "Disabling the SPI"
 * SPE must be disabled after first sampling edge and before last clock.
 * Function is called with RXNE just asserted.
 * RXNE was asserted with active edge of last cycle of last transfer
 *
 * So wait until last cycle of last transfer ends.
 * And wait until active edge of first clock of current cycle happens.
 *
 * Things may happen fast, so edges may be missed. Waiting for
 * 3 edges would not need the mode distinction, but increase chance
 * of failure.
 *
 * \param bus   Specifies the SPI bus .
 * \return      None.
 */
static void Stm32SpiCbBusRxStop(NUTSPIBUS *bus)
{
    uint32_t mode;
    STM32_SPI_DCB *dcb;
    SPI_TypeDef *spi;
    uint32_t mask;
    volatile uint32_t *idr;

    dcb = bus->bus_dcb;
    spi = (SPI_TypeDef *)bus->bus_base;
    mask = dcb->sck_input_mask;
    idr  = &dcb->sck_gpio->IDR;

    mode = spi->CR1 & (SPI_CR1_CPOL | SPI_CR1_CPHA);
    switch (mode) {
    case 0:
    case 3:
        /* Sample at rising edge */
        while (  *idr & mask );
        while (!(*idr & mask));
        break;
    default:
        /* Sample at falling edge */
        while (!(*idr & mask));
        while (  *idr & mask );
    }
    spi->CR1 &= ~SPI_CR1_SPE;
}

static void Stm32SpiCbBusInterrupt(void *arg)
{
    NUTSPIBUS *bus;
    SPI_TypeDef *spi;
    STM32_SPI_DCB *dcb;

    bus = (NUTSPIBUS *)arg;
    dcb = bus->bus_dcb;
    spi= (SPI_TypeDef *)bus->bus_base;

    if (spi->SR & SPI_SR_RXNE) {
        uint8_t b;
        b = spi->DR;
        if (dcb->spi_rx_len) {
            if (dcb->spi_rxp) {
                *dcb->spi_rxp = b;
                dcb->spi_rxp++;
                dcb->spi_rx_len--;
                if (dcb->spi_rx_len == 1) {
                    if (spi->CR1 & (SPI_CR1_BIDIMODE| SPI_CR1_RXONLY)) {
                        Stm32SpiCbBusRxStop(bus);
                    }
                }
            }
        }
        /* Terminate when the requested number of bytes have been received
         * even so perhaps we didn't need to store them.
         * That way we can make sure we don't deassert CS while SCK
         * is still running.
         */
        dcb->spi_len --;
        if (dcb->spi_len == 0) {
            spi->CR2 &= ~(SPI_CR2_TXEIE | SPI_CR2_RXNEIE);
            NutEventPostFromIrq(&bus->bus_ready);
        }
    }
    if (spi->SR & SPI_SR_TXE) {
        if (dcb->spi_tx_len) {
            /* Half word access via "spi->DR = b" shifts out two frames
             * on the F373! */
            *(uint8_t*)&spi->DR = *dcb->spi_txp;
            /* After sending the last byte we need to wait for the last
             * receive interrupt, but we are not interested in the transmitter
             * empty interrupt
             */
            dcb->spi_tx_len --;
            if (dcb->spi_tx_len == 0) {
                spi->CR2 &= ~SPI_CR2_TXEIE;
            }
            dcb->spi_txp++;
        }
    }
}
static void Stm32SpiCbDmaInterrupt(void *arg)
{
    NUTSPIBUS *bus;
    const STM32_SPI_ICB *bus_icb;

    bus = (NUTSPIBUS *) arg;
    bus_icb = (STM32_SPI_ICB *)bus->bus_icb;
    DMA_ClearFlag(bus_icb->dma_rx, DMA_TCIF);
    NutEventPostFromIrq(&bus->bus_ready);
}

/*!
 * \brief Set the specified chip select to a given level.
 */
static int Stm32SpiCbChipSelect(NUTSPINODE *node, int assert)
{
    int res;
    int hi;
    const STM32_SPI_ICB *bus_icb;
    nutgpio_t cs_pin;

