l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_spi_cb.c
    bus_icb = (STM32_SPI_ICB *)node->node_bus->bus_icb;
    cs_pin = bus_icb->cs[node->node_cs];
    res = -1;

    if (node->node_mode & SPI_MODE_CSHIGH) {
        hi = assert;
    } else {
        hi = !assert;
    }
    res = Stm32GpioSet(cs_pin, hi);
    return res;
}

/*! \brief Deselect a device on the SPI bus.
 *
 * Deactivates the chip select and unlocks the bus.
 *
 * \param node Specifies the SPI bus node.
 *
 * \return Always 0.
 */
static int Stm32SpiCbDeselect(NUTSPINODE * node)
{
    /* Sanity check. */
    NUTASSERT(node != NULL);
    NUTASSERT(node->node_bus != NULL);

    NutSpiBusWait(node, NUT_WAIT_INFINITE);
    /* Deactivate the node's chip select. */
    Stm32SpiCbChipSelect(node, 0);

    /* Release the bus. */
    NutEventPostAsync(&node->node_bus->bus_mutex);

    return 0;
}

/*! \brief Pull SCK to the node-dependant idle level.
 *
 * \param node Specifies the SPI bus node.
 */
static void SetNodeSckIdleLevel(NUTSPINODE * node)
{
    STM32_SPI_DCB *spi_dcb = (STM32_SPI_DCB *)(node->node_bus->bus_dcb);

#if defined (MCU_STM32F1)
    if (node->node_mode & SPI_MODE_CPOL) {
        spi_dcb->sck_gpio->BRR  = spi_dcb->sck_input_mask;
    } else {
        spi_dcb->sck_gpio->BSRR = spi_dcb->sck_input_mask;
    }
#else
    uint32_t pupdr;

    pupdr  = spi_dcb->sck_gpio->PUPDR;
    if (node->node_mode & SPI_MODE_CPOL) {
        pupdr |=  (1 * spi_dcb->sck_pupdr_mask);
        pupdr &= ~(2 * spi_dcb->sck_pupdr_mask);
    } else {
        pupdr &= ~(1 * spi_dcb->sck_pupdr_mask);
        pupdr |=  (2 * spi_dcb->sck_pupdr_mask);
    }
    spi_dcb->sck_gpio->PUPDR = pupdr;
#endif
}

/*!
 * \brief Update SPI shadow registers.
 *
 * Called on setup of the node or when node parameters change
 *
 * \param node Specifies the SPI bus node.
 *
 * \return Always 0.
 */
static int Stm32SpiCbNodeSetup(NUTSPINODE * node)
{
    uint32_t clk;
    STM32_SPINODE_VALUES *node_values;
    uint32_t cr1;
    int i;

    node_values = node->node_stat;

    cr1 = node_values->node_CR1;
    cr1 &= ~(SPI_CR1_LSBFIRST | SPI_CR1_CPOL | SPI_CR1_CPHA | SPI_CR1_BR);
#if defined(SPI_CR2_DS)
    node_values->node_CR2 &= ~SPI_CR2_DS;
    if ((node->node_bits > 6) && (node->node_bits <= 16)) {
        node_values->node_CR2 |= (node->node_bits - 1) <<8;
    }
#else
    switch(node->node_bits){
        case 8:
            cr1 &= ~(SPI_CR1_DFF);
            break;
        case 16:
            cr1 |= SPI_CR1_DFF;
            break;
        default:
            break;
    };
#endif
    if (node->node_mode & SPI_MODE_CPOL) {
        cr1 |= SPI_CR1_CPOL;
    }
    if (node->node_mode & SPI_MODE_CPHA) {
        cr1 |= SPI_CR1_CPHA;
    }
    if (node->node_mode & SPI_MODE_LSB) {
        cr1 |= SPI_CR1_LSBFIRST;
    }
    /* Query peripheral clock. */
    clk = Stm32ClockGet(BASE2CLKSRC(node->node_bus->bus_base));
    for (i = 0; i < 7 ; i++) {
        clk >>= 1;
        if (node->node_rate >= clk) {
            break;
        }
    }
    node->node_rate = clk;
    cr1 |= i * SPI_CR1_BR_0;
    node_values->node_CR1 = cr1;
    /* Update interface parameters. */
    node->node_mode &= ~SPI_MODE_UPDATE;

    return 0;
}

/*! \brief Select a device on the SPI bus.
 *
 * Locks and activates the bus for the specified node.
 *
 * \param node Specifies the SPI bus node.
 * \param tmo  Timeout in milliseconds. To disable timeout, set this
 *             parameter to NUT_WAIT_INFINITE.
 *
 * \return 0 on success. In case of an error, -1 is returned and the bus
 *         is not locked.
 */
static int Stm32SpiCbSelect(NUTSPINODE * node, uint32_t tmo)
{
    int rc;
    SPI_TypeDef *base = (SPI_TypeDef *)node->node_bus->bus_base;

    /* Sanity check. */
    NUTASSERT(node != NULL);
    NUTASSERT(node->node_bus != NULL);
    NUTASSERT(node->node_stat != NULL);

    /* Allocate the bus. */
    rc = NutEventWait(&node->node_bus->bus_mutex, tmo);
    if (rc) {
        errno = EIO;
    } else {
        STM32_SPINODE_VALUES *node_values = node->node_stat;

        /* If the mode update bit is set, then update our shadow registers. */
        if (node->node_mode & SPI_MODE_UPDATE) {
            Stm32SpiCbNodeSetup(node);
        }

        /* Set Idle level before enabling SPI.
         * See note e.g. in RM0316 28.5.5 Communication formats
         */
        SetNodeSckIdleLevel(node);

        /* Set SPI mode. */
        base->CR1 = node_values->node_CR1;
        base->CR2 = node_values->node_CR2;
        /* Finally activate the node's chip select. */
        rc = Stm32SpiCbChipSelect(node, 1);
        if (rc) {
            /* Release the bus in case of an error. */
            NutEventPost(&node->node_bus->bus_mutex);
        }
    }
    return rc;
}

/*!
 * \brief Initialize an SPI bus..
 *
 * This routine is called for the first SPI node, which is registered via
 * NutRegisterSpiDevice().
 *
 * \param bus      Specifies the SPIBUS.
 *
 * \return 0 on success or -1 if there is no valid chip select.
 */
static int Stm32SpiCbBusInit(NUTSPIBUS *bus)
{
    uint32_t flags;
    int pin_nr;
    GPIO_TypeDef *gpio;
    STM32_SPI_DCB *bus_dcb;
    const STM32_SPI_ICB *bus_icb;

    bus_icb = (STM32_SPI_ICB *)bus->bus_icb;
    bus_dcb = malloc(sizeof(STM32_SPI_DCB));
    if (!bus_dcb) {
        return -1;
    }
    /* Initialize Bus Hardware */
    flags = bus_icb->device_pin_speed;
    flags |= GPIO_CFG_PERIPHAL | GPIO_CFG_OUTPUT | GPIO_CFG_INIT_LOW;
    Stm32GpioConfigSet(bus_icb->sck,  flags            , bus_icb->sck_af );
    Stm32GpioConfigSet(bus_icb->miso, GPIO_CFG_PERIPHAL, bus_icb->miso_af);
    Stm32GpioConfigSet(bus_icb->mosi, flags            , bus_icb->mosi_af);
    /* Calculate SCK/MOSI speed register pointer and offsets.
     * nutgpio_t enum defeats compile time compilation!
     */
    gpio = stm32_port_nr2gpio[bus_icb->sck >> 8];
    pin_nr = bus_icb->sck & 0xf;
    bus_dcb->sck_gpio = gpio;
    bus_dcb->sck_input_mask = 1 << pin_nr;
    bus_dcb->sck_pupdr_mask = 1 << (pin_nr << 1);
    bus->bus_dcb = bus_dcb;
    Stm32SpiCbClkEnable(bus_icb, 1);
    if (bus_icb->transfer_mode == IRQ_MODE) {
        NutRegisterIrqHandler(bus->bus_sig, Stm32SpiCbBusInterrupt, bus);
        NutIrqEnable(bus->bus_sig);
    } else if (bus_icb->transfer_mode == DMA_MODE) {
        DMA_SIGNAL *sig;
        DMA_Init();
# if defined(HW_DMA_CSELR_STM32)
        DmaChannelSelection(bus_icb->dma_rx, bus_icb->dma_rx_csel);
        DmaChannelSelection(bus_icb->dma_tx, bus_icb->dma_tx_csel);
#endif
        sig = DmaCreateHandler(bus_icb->dma_rx, bus_icb->dma_rx_irq);
        DmaRegisterHandler(sig, Stm32SpiCbDmaInterrupt, bus,
                           bus_icb->dma_rx, bus_icb->dma_rx_irq);
    }
    return 0;
}

/*!
 * \brief Initialize an SPI bus node.
 *
 * This routine is called for each SPI node, which is registered via
 * NutRegisterSpiDevice().
 *
 * \param node Specifies the SPI bus node.
 *
 * \return 0 on success or -1 if there is no valid chip select.
 */
static int Stm32SpiCbNodeInit(NUTSPINODE *node)
{
    int rc;
    uint32_t init_flag;
    NUTSPIBUS *bus;
    const STM32_SPI_ICB *bus_icb;
    nutgpio_t cs_pin

    /* Sanity check. */
    NUTASSERT(node != NULL);
    NUTASSERT(node->node_bus != NULL);
    NUTASSERT(node->node_bus->bus_base != NULL);
    bus = node->node_bus;
    bus_icb = (STM32_SPI_ICB *)bus->bus_icb;
    /* Initialize CS pin */
    if ((node->node_mode & SPI_MODE_CSHIGH) == 0) {
        init_flag = GPIO_CFG_INIT_HIGH;
    } else {
        init_flag = GPIO_CFG_INIT_LOW;
    }
    cs_pin = bus_icb->cs[node->node_cs];
    rc = Stm32GpioConfigSet(cs_pin, GPIO_CFG_OUTPUT | init_flag, 0);
    if (rc) {
        return rc;
    }
    if (node->node_bits != 8) {
        return -1;
    }
    /* Test if SPI Device is already initialized*/
    if (!bus->bus_dcb) {
        rc = Stm32SpiCbBusInit(bus);
    }
    /* It should not hurt us being called more than once. Thus, we
     * check wether any initialization had been taken place already.
     */
    if ((rc == 0) && (node->node_stat == NULL)) {
        /* Allocate and set our shadow registers. */
        STM32_SPINODE_VALUES *node_values =
            malloc(sizeof(STM32_SPINODE_VALUES));

