l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_spi_cb.c
        if (!node_values) {
            /* Out of memory? */
            rc = -1;
        } else {
            /* Set interface defaults. */
            node_values->node_CR1 = SPI_CR1_SSM | SPI_CR1_SSI | SPI_CR1_MSTR;
            /* FIXME: Check values needed*/
#if defined(SPI_CR2_FRXTH)
            node_values->node_CR2 = SPI_CR2_FRXTH |
                ((node->node_bits - 1) * SPI_CR2_DS_0);
#else
            node_values->node_CR2 =  0;
#endif
            /* Update with node's defaults. */
            node->node_stat = (void *)node_values;
            Stm32SpiCbNodeSetup(node);
        }
    }
    return rc;
}

static void PollingTransfer(
    NUTSPINODE * node, const void *txbuf, void *rxbuf, int xlen)
{
    SPI_TypeDef *base;
    STM32_SPI_DCB *bus_dcb;

    base = (SPI_TypeDef *)node->node_bus->bus_base;
    bus_dcb = (STM32_SPI_DCB *)node->node_bus->bus_dcb;

    if (!rxbuf) {
        base->CR1 |= SPI_CR1_SPE;
        while (xlen > 0) {
            /* Half word access via "spi->DR = b" shifts out two frames
             * on the F373! */
            *(uint8_t *)&base->DR = *(const uint8_t *)txbuf;
            xlen--;
            txbuf++;
            while ((base->SR & SPI_SR_TXE) == 0); /* Wait till TXE = 1*/
        }
        while (base->SR & SPI_SR_BSY);     /* Wait till BSY = 0 */
        /* Wait for SCK idle */
        if (node->node_mode & SPI_MODE_CPOL) {
            while (!(bus_dcb->sck_gpio->IDR & bus_dcb->sck_input_mask));
        } else {
            while ((bus_dcb->sck_gpio->IDR & bus_dcb->sck_input_mask));
        }
    } else if (!txbuf) {
        base->CR1 |= SPI_CR1_SPE;
        while (xlen > 0) {
            if (xlen < 2) {
                Stm32SpiCbBusRxStop(node->node_bus);
            }
            xlen--;
            while ((base->SR & SPI_SR_RXNE) == 0); /* Wait till RXNE = 1*/
            if (rxbuf) {
                *(uint8_t *)rxbuf = base->DR;
                rxbuf++;
            }
        }
    } else {
        base->CR1 |= SPI_CR1_SPE;
        *(uint8_t *)&base->DR = *(const uint8_t *)txbuf; /* Write first item */
        while (xlen > 0) {
            txbuf++;
            xlen --;
#if defined(SPI_CR2_FRXTH)
            /* F0/F3/F7/L4 has 4 byte Fifo.
               Write new data before reading last data.*/
            if (xlen > 0) {
                while ((base->SR & SPI_SR_TXE) == 0); /* Wait till TXE = 1*/
                *(uint8_t *)&base->DR = *(const uint8_t *)txbuf;
            }
            while ((base->SR & SPI_SR_RXNE) == 0);/* Wait till RXNE = 1*/
            *(uint8_t *)rxbuf = base->DR;
#else
            /* First version of SPI implementation has only "one-byte" Fifo.
               Read last data before writing next data as otherwise with
               fast transfer, received byte can get lost.*/
             while ((base->SR & SPI_SR_RXNE) == 0);/* Wait till RXNE = 1*/
            *(uint8_t *)rxbuf = base->DR;
            while ((base->SR & SPI_SR_TXE) == 0); /* Wait till TXE = 1*/
            if (xlen > 0) {
                while ((base->SR & SPI_SR_TXE) == 0); /* Wait till TXE = 1*/
                *(uint8_t *)&base->DR = *(const uint8_t *)txbuf;
            }
#endif
            rxbuf++;
        }
        /* Wait until SCK reaches idle level.*/
        if (node->node_mode & SPI_MODE_CPOL) {
            while (!(bus_dcb->sck_gpio->IDR & bus_dcb->sck_input_mask));
        } else {
            while (  bus_dcb->sck_gpio->IDR & bus_dcb->sck_input_mask );
        }
    }
}

/*!
 * \brief Transfer data on the SPI bus using single buffered interrupt mode.
 *
 * A device must have been selected by calling SpiSelect().
 *
 * \param node  Specifies the SPI bus node.
 * \param txbuf Pointer to the transmit buffer. If NULL, undetermined
 *              byte values are transmitted.
 * \param rxbuf Pointer to the receive buffer. If NULL, then incoming
 *              data is discarded.
 * \param xlen  Number of bytes to transfer.
 *
 * \return Always 0.
 */
static int Stm32SpiCbTransfer
    (NUTSPINODE * node, const void *txbuf, void *rxbuf, int xlen)
{
    NUTSPIBUS *bus;
    SPI_TypeDef *base;
    const STM32_SPI_ICB *bus_icb;

    /* Sanity check and query MISO. */
    if (xlen == 0) {
        const STM32_SPI_ICB *bus_icb;
        bus_icb = (STM32_SPI_ICB *)node->node_bus->bus_icb;
        return Stm32GpioGet(bus_icb->miso);
    }

    bus = node->node_bus;
    base = (SPI_TypeDef *)bus->bus_base;
    bus_icb = (STM32_SPI_ICB *)bus->bus_icb;

    /* Remove any remainders in DR */
    while (base->SR & SPI_SR_RXNE) {
        (void) base->DR; /* Empty DR */
    }
    if (!txbuf) {
        if (node->node_mode & SPI_MODE_HALFDUPLEX) {
            base->CR1 |= SPI_CR1_BIDIMODE;
        } else {
            base->CR1 |= SPI_CR1_RXONLY;
        }
    }

    if (bus_icb->transfer_mode == POLLING_MODE) {
        PollingTransfer(node, txbuf, rxbuf, xlen);
    } else if (bus_icb->transfer_mode == DMA_MODE) {
        if (!txbuf) {
            DMA_Setup(bus_icb->dma_rx, rxbuf, (void*)(&base->DR),
                      xlen , DMA_MINC);
            DMA_Enable(bus_icb->dma_rx);
        } else {
            DMA_Setup(bus_icb->dma_tx, (void*)(&base->DR), (void*) txbuf,
                      xlen, DMA_MINC);
            DMA_Enable(bus_icb->dma_tx);
            if (!rxbuf) {
                uint32_t dummy;
                DMA_Setup(bus_icb->dma_rx, &dummy, (void*)(&base->DR), xlen, 0);
            } else {
                DMA_Setup(bus_icb->dma_rx, rxbuf, (void*)(&base->DR), xlen,
                          DMA_MINC);
            }
            base->CR2 |= SPI_CR2_TXDMAEN;
        }
        DMA_Enable(bus_icb->dma_rx);
        DMA_IrqMask(bus_icb->dma_rx, DMA_TCIF, 1);
        base->CR2 |= SPI_CR2_RXDMAEN;
        base->CR1 |= SPI_CR1_SPE;
        NutEventWait(&node->node_bus->bus_ready, NUT_WAIT_INFINITE);
    } else {
        /* IRQ Transfer */
        STM32_SPI_DCB *dcb;

        dcb = bus->bus_dcb;
        dcb->spi_txp = txbuf;
        dcb->spi_rxp = rxbuf;
        dcb->spi_len = xlen;
        dcb->spi_rx_len = xlen;
        if (!txbuf) {
            dcb->spi_tx_len = 0;
            base->CR2 |= SPI_CR2_RXNEIE;
            base->CR1 |= SPI_CR1_SPE;
        } else {
            dcb->spi_tx_len = xlen;
            if (!rxbuf) {
                dcb->spi_rx_len = 0;
            }
            base->CR2 |= SPI_CR2_RXNEIE;
            base->CR1 |= SPI_CR1_SPE;
            base->CR2 |= SPI_CR2_TXEIE;
        }
        NutEventWait(&node->node_bus->bus_ready, NUT_WAIT_INFINITE);
    }
    base->CR1 &= ~(SPI_CR1_SPE | SPI_CR1_RXONLY | SPI_CR1_BIDIMODE);
    base->CR2 &= ~(SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
    return 0;
}

#if defined(HW_SPI1_STM32)
STM32_SPI_ICB Stm32Spi1Icb = {
    .transfer_mode = SPI1_MODE,
    .device_pin_speed = SPI1_SPEED,
#if defined(MCU_STM32F1)
    .remap_reg = &AFIO->MAPR,
    .remap_mask = AFIO_MAPR_SPI1_REMAP,
    .remap_value = SPI1_REMAP * AFIO_MAPR_SPI1_REMAP,
#endif
    .enable_reg = &RCC->APB2ENR,
    .enable_mask = RCC_APB2ENR_SPI1EN,
    .dma_tx_irq = DMA_CH2IRQ_P(SPI1_DMA_TX),
    .dma_rx_irq = DMA_CH2IRQ_P(SPI1_DMA_RX),
    .dma_tx = SPI1_DMA_TX,
    .dma_rx = SPI1_DMA_RX,
#if defined(HW_DMA_CSELR_STM32)
    .dma_rx_csel = SPI1_DMA_RX_SEL(SPI1_DMA_RX),
    .dma_tx_csel = SPI1_DMA_TX_SEL(SPI1_DMA_TX),
#endif
    .sck = SPI1_SCK,
    .sck_af = SPI1_SCK_AF,
    .mosi = SPI1_MOSI,
    .mosi_af = SPI1_MOSI_AF,
    .miso = SPI1_MISO,
    .miso_af = SPI1_MISO_AF,
    .cs[0] = SPI1_CS0,
    .cs[1] = SPI1_CS1,
    .cs[2] = SPI1_CS2,
    .cs[3] = SPI1_CS3
};

NUTSPIBUS spiBus1Stm32Cb = {
    .bus_sig      =  &sig_SPI1,
    .bus_base     = (uintptr_t)SPI1_BASE,
    .bus_initnode = Stm32SpiCbNodeInit,
    .bus_alloc    = Stm32SpiCbSelect,
    .bus_release  = Stm32SpiCbDeselect,
    .bus_transfer = Stm32SpiCbTransfer,
    .bus_wait     = NutSpiBusWait,
    .bus_set_mode = NutSpiBusSetMode,
    .bus_set_rate = NutSpiBusSetRate,
    .bus_set_bits = NutSpiBusSetBits,
    .bus_icb      = (void*)&Stm32Spi1Icb,
};
#endif

#if defined(HW_SPI2_STM32)
STM32_SPI_ICB Stm32Spi2Icb = {
    .transfer_mode = SPI2_MODE,
    .device_pin_speed = SPI2_SPEED,
#if defined(MCU_STM32F1)
    .remap_reg = &AFIO->MAPR,
    .remap_mask = 0,
    .remap_value = 0,
#endif
    .enable_reg = &RCC->APB1ENR,
    .enable_mask = RCC_APB1ENR_SPI2EN,
    .dma_tx_irq = DMA_CH2IRQ_P(SPI2_DMA_TX),
    .dma_rx_irq = DMA_CH2IRQ_P(SPI2_DMA_RX),
    .dma_tx = SPI2_DMA_TX,
    .dma_rx = SPI2_DMA_RX,
#if defined(HW_DMA_CSELR_STM32)
    .dma_rx_csel = SPI2_DMA_RX_SEL(SPI2_DMA_RX),
    .dma_tx_csel = SPI2_DMA_TX_SEL(SPI2_DMA_TX),
#endif
    .sck = SPI2_SCK,
    .sck_af = SPI2_SCK_AF,
    .mosi = SPI2_MOSI,
    .mosi_af = SPI2_MOSI_AF,
    .miso = SPI2_MISO,
    .miso_af = SPI2_MISO_AF,
    .cs[0] = SPI2_CS0,
    .cs[1] = SPI2_CS1,
    .cs[2] = SPI2_CS2,
    .cs[3] = SPI2_CS3
};

NUTSPIBUS spiBus2Stm32Cb = {
    .bus_sig      =  &sig_SPI2,
    .bus_base     = (uintptr_t)SPI2_BASE,
    .bus_initnode = Stm32SpiCbNodeInit,
    .bus_alloc    = Stm32SpiCbSelect,
    .bus_release  = Stm32SpiCbDeselect,
    .bus_transfer = Stm32SpiCbTransfer,
    .bus_wait     = NutSpiBusWait,
    .bus_set_mode = NutSpiBusSetMode,
    .bus_set_rate = NutSpiBusSetRate,
    .bus_set_bits = NutSpiBusSetBits,
    .bus_icb      = (void*)&Stm32Spi2Icb,
};
#endif

#if defined(HW_SPI3_STM32)
STM32_SPI_ICB Stm32Spi3Icb = {
     .transfer_mode = SPI3_MODE,
     .device_pin_speed = SPI3_SPEED,
#if defined(MCU_STM32F1) && defined(AFIO_MAPR_SPI3_REMAP)
     .remap_reg = &AFIO->MAPR,
     .remap_mask = AFIO_MAPR_SPI3_REMAP,
     .remap_value = SPI3_REMAP * AFIO_MAPR_SPI3_REMAP,
#endif
     .enable_reg = &RCC->APB1ENR,
     .enable_mask = RCC_APB1ENR_SPI3EN,
     .dma_tx_irq = DMA_CH2IRQ_P(SPI3_DMA_TX),
     .dma_rx_irq = DMA_CH2IRQ_P(SPI3_DMA_RX),
     .dma_tx = SPI3_DMA_TX,
     .dma_rx = SPI3_DMA_RX,
#if defined(HW_DMA_CSELR_STM32)
     .dma_rx_csel = SPI3_DMA_RX_SEL(SPI3_DMA_RX),
     .dma_tx_csel = SPI3_DMA_TX_SEL(SPI3_DMA_TX),
#endif
     .sck = SPI3_SCK,
     .sck_af = SPI3_SCK_AF,
     .mosi = SPI3_MOSI,
     .mosi_af = SPI3_MOSI_AF,
     .miso = SPI3_MISO,
     .miso_af = SPI3_MISO_AF,
     .cs[0] = SPI3_CS0,
     .cs[1] = SPI3_CS1,
     .cs[2] = SPI3_CS2,
     .cs[3] = SPI3_CS3
};

NUTSPIBUS spiBus3Stm32Cb = {
    .bus_sig      =  &sig_SPI3,
    .bus_base     = (uintptr_t)SPI3_BASE,
    .bus_initnode = Stm32SpiCbNodeInit,
    .bus_alloc    = Stm32SpiCbSelect,
    .bus_release  = Stm32SpiCbDeselect,
    .bus_transfer = Stm32SpiCbTransfer,
    .bus_wait     = NutSpiBusWait,
    .bus_set_mode = NutSpiBusSetMode,
    .bus_set_rate = NutSpiBusSetRate,
    .bus_set_bits = NutSpiBusSetBits,
    .bus_icb      = &Stm32Spi3Icb,
};
#endif

#if defined(HW_SPI4_STM32)
STM32_SPI_ICB Stm32Spi4Icb = {
     .transfer_mode = SPI4_MODE,
     .device_pin_speed = SPI4_SPEED,
    .enable_reg = &RCC->APB2ENR,
    .enable_mask = RCC_APB2ENR_SPI4EN,
    .dma_tx_irq = DMA_CH2IRQ_P(SPI4_DMA_TX),
    .dma_rx_irq = DMA_CH2IRQ_P(SPI4_DMA_RX),
    .dma_tx = SPI4_DMA_TX,
    .dma_rx = SPI4_DMA_RX,
    .sck = SPI4_SCK,
    .sck_af = SPI4_SCK_AF,
    .mosi = SPI4_MOSI,
    .mosi_af = SPI4_MOSI_AF,
    .miso = SPI4_MISO,
    .miso_af = SPI4_MISO_AF,
    .cs[0] = SPI4_CS0,
    .cs[1] = SPI4_CS1,
    .cs[2] = SPI4_CS2,
    .cs[3] = SPI4_CS3
};

NUTSPIBUS spiBus4Stm32Cb = {
    .bus_sig      =  &sig_SPI4,
    .bus_base     = (uintptr_t)SPI4_BASE,
    .bus_initnode = Stm32SpiCbNodeInit,
    .bus_alloc    = Stm32SpiCbSelect,
    .bus_release  = Stm32SpiCbDeselect,
    .bus_transfer = Stm32SpiCbTransfer,
    .bus_wait     = NutSpiBusWait,
    .bus_set_mode = NutSpiBusSetMode,
    .bus_set_rate = NutSpiBusSetRate,
    .bus_set_bits = NutSpiBusSetBits,
    .bus_icb      = &Stm32Spi4Icb,
};
#endif

