l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_spi_cb.c
#if defined(HW_SPI5_STM32)
STM32_SPI_ICB Stm32Spi5Icb = {
     .transfer_mode = SPI5_MODE,
     .device_pin_speed = SPI5_SPEED,
    .enable_reg = &RCC->APB2ENR,
    .enable_mask = RCC_APB2ENR_SPI5EN,
    .dma_tx_irq = DMA_CH2IRQ_P(SPI5_DMA_TX),
    .dma_rx_irq = DMA_CH2IRQ_P(SPI5_DMA_RX),
    .dma_tx = SPI5_DMA_TX,
    .dma_rx = SPI5_DMA_RX,
    .sck = SPI5_SCK,
    .sck_af = SPI5_SCK_AF,
    .mosi = SPI5_MOSI,
    .mosi_af = SPI5_MOSI_AF,
    .miso = SPI5_MISO,
    .miso_af = SPI5_MISO_AF,
    .cs[0] = SPI5_CS0,
    .cs[1] = SPI5_CS1,
    .cs[2] = SPI5_CS2,
    .cs[3] = SPI5_CS3
};

NUTSPIBUS spiBus5Stm32Cb = {
    .bus_sig      =  &sig_SPI5,
    .bus_base     = (uintptr_t)SPI5_BASE,
    .bus_initnode = Stm32SpiCbNodeInit,
    .bus_alloc    = Stm32SpiCbSelect,
    .bus_release  = Stm32SpiCbDeselect,
    .bus_transfer = Stm32SpiCbTransfer,
    .bus_wait     = NutSpiBusWait,
    .bus_set_mode = NutSpiBusSetMode,
    .bus_set_rate = NutSpiBusSetRate,
    .bus_set_bits = NutSpiBusSetBits,
    .bus_icb      = &Stm32Spi5Icb,
};
#endif

#if defined(HW_SPI6_STM32)
STM32_SPI_ICB Stm32Spi6Icb = {
     .transfer_mode = SPI6_MODE,
     .device_pin_speed = SPI6_SPEED,
    .enable_reg = &RCC->APB2ENR,
    .enable_mask = RCC_APB2ENR_SPI6EN,
    .dma_tx_irq = DMA_CH2IRQ_P(SPI6_DMA_TX),
    .dma_rx_irq = DMA_CH2IRQ_P(SPI6_DMA_RX),
    .dma_tx = SPI6_DMA_TX,
    .dma_rx = SPI6_DMA_RX,
    .sck = SPI6_SCK,
    .sck_af = SPI6_SCK_AF,
    .mosi = SPI6_MOSI,
    .mosi_af = SPI6_MOSI_AF,
    .miso = SPI6_MISO,
    .miso_af = SPI6_MISO_AF,
    .cs[0] = SPI6_CS0,
    .cs[1] = SPI6_CS1,
    .cs[2] = SPI6_CS2,
    .cs[3] = SPI6_CS3
};

NUTSPIBUS spiBus6Stm32Cb = {
    .bus_sig      =  &sig_SPI6,
    .bus_base     = (uintptr_t)SPI6_BASE,
    .bus_initnode = Stm32SpiCbNodeInit,
    .bus_alloc    = Stm32SpiCbSelect,
    .bus_release  = Stm32SpiCbDeselect,
    .bus_transfer = Stm32SpiCbTransfer,
    .bus_wait     = NutSpiBusWait,
    .bus_set_mode = NutSpiBusSetMode,
    .bus_set_rate = NutSpiBusSetRate,
    .bus_set_bits = NutSpiBusSetBits,
    .bus_icb      = &Stm32Spi6Icb,
};
#endif
